Revit 2027 API
ParameterTypeId.RasterEnableSnaps Property
 "Enable Snaps"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RasterEnableSnaps { get; }
Public Shared ReadOnly Property RasterEnableSnaps As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RasterEnableSnaps {
	ForgeTypeId^ get ();
}
static member RasterEnableSnaps : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace